import React, { useEffect } from 'react'
import WordEffect from './WordEffect'
import anime from "animejs"

function TextEffect({ text, contText }) {
  const words = text.split(" ")
    .map((word, i) => {
      const greekWord = shuffle(greek).find(greekWord => greekWord.length === word.length)
      return {
        type: "greek",
        latin: word,
        greek: greekWord,
        index: i
      }
    })

  const changeIndexes = shuffle([...words]).map(({ index }) => index)

  useEffect(() => {
    anime.timeline({ loop: false })
      .add({
        targets: `#contText`,
        scale: [14, 1],
        opacity: [0, 1],
        easing: "easeOutCirc",
        duration: 1500,
        delay: () => 6000 + 50 * changeIndexes.length
      })
  }, [])

  return <div className="flex flex-col justify-between items-center w-8/12 h-3/5">
    <div className="flex flex-wrap justify-center w-full font-greek xl:text-xl 2xl:text-2xl 3xl:text-4xl">

      {words.map(({ type, latin, greek, index }) => {
        return <WordEffect word={latin} greekWord={greek} index={index} changeIndex={changeIndexes[index]}></WordEffect>
      })}
    </div>
    <div className="flex justify-center w-full text-3xl 3xl:text-5xl font-greek">
      <span id="contText">{contText}</span>
    </div>
  </div>

}

const shuffle = a => {
  for (let i = a.length - 1; i > 0; i--) {
    const j = Math.floor(Math.random() * (i + 1));
    [a[i], a[j]] = [a[j], a[i]];
  }
  return a;
}

const greek = `λορεμ ιπσυμ δολορ σιτ αμετg χονσεχτετυρ αδιπισχινγ ελιτ σεδ δο ειυσμοδ τεμπορ ινχιδιδυντ υτ λαβορε ετ δολορε μαγνα αλιθυα σιτ αμετ χυρσυς σιτ αμετ χονϝαλλις χονϝαλλις τελλυς ιδ ιντερδυμ ϝελιτ λαορεετ σεδ αδιπισχινγ διαμ δονεχ αδιπισχινγ τριστιθυε ρισυς νεχ φυσχε υτ πλαχερατ ορχι νυλλα πελλεντεσθυε διγνισσιμ ενιμ σιτ αμετ ιδ νιβη τορτορ ιδ αλιθυετ λεχτυς αρχυ βιβενδυμ ατ ϝαριυς ϝελ πηαρετρα ϝελ ιπσυμ συσπενδισσε υλτριχες γραϝιδα διχτυμ φυσχε υτ πλαχερατ ορχι ϝενενατις χρας σεδ φελις εγετ αλιθυετ σαγιττις ιδ χονσεχτετυρ πυρυς υτ τριστιθυε νυλλα αλιθυετ ενιμ τορτορ ατ αυχτορ υρνα διχτυμστ θυισθυε σαγιττις πυρυς σιτ αμετ ϝολυτπατ χονσεθυατ μαυρις νιβη πραεσεντ τριστιθυε μαγνα σιτ αμετ ελιτ δυις τριστιθυε σολλιχιτυδιν νιβη σιτ αμετ χομμοδο νυλλα φαχιλισι νεθυε εγεστας χονγυε θυισθυε εγεστας διαμ ιν αρχυ χυρσυς ευισμοδ σαγιττις ορχι α σχελερισθυε πυρυς σεμπερ εγετ δυις τυρπις χυρσυς ιν ηαχ ηαβιτασσε αενεαν ϝελ ελιτ σχελερισθυε μαυρις σεδ αρχυ νον οδιο ευισμοδ δυις υλτριχιες λαχυς σεδ τυρπις τινχιδυντ ιδ αλιθυετ ρισυς φευγιατ δονεχ αχ οδιο τεμπορ ορχι δαπιβυς υλτριχες αδιπισχινγ ελιτ δυις τριστιθυε σολλιχιτυδιν νιβη σιτ αμετ ϝιϝερρα μαυρις ιν αλιθυαμ σεμ φρινγιλλα υτ μορβι ατ ϝολυτπατ διαμ υτ ϝενενατις τελλυς ιν μετυς ιπσυμ συσπενδισσε υλτριχες γραϝιδα διχτυμ φυσχε ρισυς πρετιυμ θυαμ ϝυλπυτατε διγνισσιμ συσπενδισσε ιν εστ αντε ϝιϝερρα ιπσυμ νυνχ αλιθυετ βιβενδυμ ενιμ ιν πελλεντεσθυε μασσα πλαχερατ δυις υλτριχιες λαχυς σεδ τυρπις τινχιδυντ εστ σιτ αμετ φαχιλισις μαγνα ετιαμ τεμπορ αμετ ϝενενατις υρνα χυρσυς εγετ νυνχ γραϝιδα ρυτρυμ θυισθυε νον τελλυς ορχι αχ πηαρετρα διαμ σιτ αμετ νισλ συσχιπιτ αδιπισχινγ βιβενδυμ εστ αχχυμσαν σιτ αμετ νυλλα φαχιλισι μορβι τεμπυς φαυχιβυς α πελλεντεσθυε σιτ αμετ πορττιτορ εγετ δολορ μορβι ρηονχυς εστ πελλεντεσθυε ελιτ υλλαμχορπερ χομμοδο ϝιϝερρα μαεχενας αχχυμσαν λαχυς ϝελ φαχιλισις ϝολυτπατ εστ ϝελιτ σχελερισθυε ιν διχτυμ νον χονσεχτετυρ α ερατ ναμ τεμπυς θυαμ πελλεντεσθυε νεχ ναμ αλιθυαμ σεμ ετ τορτορ υτ τελλυς ελεμεντυμ σαγιττις ϝιταε ετ λεο δυις αλιθυετ λεχτυς προιν νιβη νισλ χονδιμεντυμ ιδ ϝενενατις α νεθυε ϝιϝερρα ϲυστο νεχ υλτριχες δυι μορβι τριστιθυε σενεχτυς ετ νετυς`
  .split(" ")
export default TextEffect